# SERIES & COLUMNS
***
## $Selecting$ $A$ $Single$ $Column$

In [1]:
# Pandas modülünü import edelim
import pandas as pd

In [2]:
# Çalışmamızda kullanacağımız bütün veri setlerini import edelim
houses = pd.read_csv("../data/kc_house_data.csv")
titanic = pd.read_csv("../data/titanic.csv")
netflix = pd.read_csv("../data/netflix_titles.csv", sep="|", index_col=0)

In [3]:
# Titanic veri setinin ilk beş örneğini inceleyelim
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29,0,0,24160,211.3375,B5,S,2,?,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.55,C22 C26,S,11,?,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30,1,2,113781,151.55,C22 C26,S,?,135,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25,1,2,113781,151.55,C22 C26,S,?,?,"Montreal, PQ / Chesterville, ON"

In [4]:
# Titanic veri setinin "name" sütununu seçelim
print(titanic.name)

0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object

In [5]:
# Aynı işlemi aşağıdaki şekilde de gerçekleştirebiliriz
print(titanic["name"])

0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object

In [6]:
# Elde ettiğimiz yapının ne olduğunu görelim
type(titanic["name"])

pandas.core.series.Series

In [7]:
# Titanic veri setinin boyutlarına bakalım
titanic.shape

(1309, 14)

In [8]:
# Age sütununu inceleyelim
titanic["age"]

0           29
1       0.9167
2            2
3           30
4           25
         ...
1304      14.5
1305         ?
1306      26.5
1307        27
1308        29
Name: age, Length: 1309, dtype: object

***
**Yukarıda gerçekleştirdiğimiz işlemleri incelediğinizde, `titanic.age` ile `titanic["age"]` kullanımının aynı sonucu verdiğini görebilirsiniz. Bununla birlikte, güvenlik ve okunabilirlik açısından *`titanic["age]`* kullanımı daha uygundur. Sütun isminde bir *boşluk* karakteri varsa, sütun isminde bir "nokta" işareti varsa, birden fazla sütunu aynı anda kullanmak istiyorsak `.` ile kullanım yanlış tercih olacaktır, `[""]` kullanımı ile bu yanlış tercihin önüne geçilebilir. Bununla birlikte kullandığımız sütun ismi, kod içerisindeki bir sınıf, metot, değişken ismi ile aynı olabilir. Bu durumda karmaşa yaratmamak adına yine `[""]` formatını kullanmak uygun olacaktır. Ayrıca bu formatı kullanarak aşağıdaki dinamik işlemleri de gerçekleştirebiliriz.**
***

In [9]:
ageValue = "age"

In [10]:
titanic[ageValue]

0           29
1       0.9167
2            2
3           30
4           25
         ...
1304      14.5
1305         ?
1306      26.5
1307        27
1308        29
Name: age, Length: 1309, dtype: object

***
## $Closer$ $Look$ $At$ $Series$

**`TANIM`**: Seriler, tek boyutlu etiketli dizilerdir. Etiktet değerleri, indis olarak kullanılabilir. Seri verilerine `values`, indis değerlerine ise `index` metotları ile erişilebilir. Bir yapı, `Series` komutu ile Pandas serisine dönüştürülebilir. Bununla birlite; `value_counts` metodu ile seri içerisinde her bir elemandan kaç adet olduğu yani sıklık bilgisi, `size` metodu ile serinin eleman sayısı, `mode` metodu ile seride en çok tekrar eden eleman bilgisine erişebiliriz.

In [11]:
# Seriler konusunu işlerken "titanic" dataframe'inin "name" sütununu ele alalım
names = titanic["name"]

In [12]:
# "names" değişkenininy yapısını inceleyelim
type(names)

pandas.core.series.Series

In [13]:
# Gördüğünüz üzere "names" Seri veri tipinde bir değişkendir.
print(names)

0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object

In [14]:
# Tanım kısmında bahsedilen metotları inceleyelim.
print(f"Values of the \"names\" series: {names.values}\n\n")
print(f"İndexes of the \"names\" series: {names.index}\n\n")
print(f"Value counts of the \"names\" series:\n {names.value_counts}\n")
print(f"Size of the \"names\" series: {names.size}\n\n")
print(f"Mode of the \"names\" series: {names.mode}\n\n")

Values of the "names" series: ['Allen, Miss. Elisabeth Walton' 'Allison, Master. Hudson Trevor'
 'Allison, Miss. Helen Loraine' ... 'Zakarian, Mr. Mapriededer'
 'Zakarian, Mr. Ortin' 'Zimmerman, Mr. Leo']


İndexes of the "names" series: RangeIndex(start=0, stop=1309, step=1)


Value counts of the "names" series:
 <bound method IndexOpsMixin.value_counts of 0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object>

Size of the "names" series: 1309


Mode of the "names" series: <bound method Series.mode of 0                         Allen, Miss. Elisabeth Walton
1                        Allison, Master. Hudson Trevor
2                          Allison, Miss. Helen Loraine
3                  Allison, Mr. Hudson Joshua Creighton
4       Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
                             ...
1304                               Zabour, Miss. Hileni
1305                              Zabour, Miss. Thamine
1306                          Zakarian, Mr. Mapriededer
1307                                Zakarian, Mr. Ortin
1308                                 Zimmerman, Mr. Leo
Name: name, Length: 1309, dtype: object>

In [15]:
# Serinin etiketi her zaman nümerik olmak zorunda değildir.
# Bunu görmek için mean() metodunu kullanalım. mean() metodu geriye bir seri veri yapısında değişken döner.
houses_mean = houses.mean(numeric_only=True)

In [16]:
# Görüldüğü üzere aşağıdaki serinin etiketleri string tipindedir.
print(houses_mean)

id               4.580302e+09
price            5.400881e+05
bedrooms         3.370842e+00
bathrooms        2.114757e+00
sqft_living      2.079900e+03
sqft_lot         1.510697e+04
floors           1.494309e+00
waterfront       7.541757e-03
view             2.343034e-01
condition        3.409430e+00
grade            7.656873e+00
sqft_above       1.788391e+03
sqft_basement    2.915090e+02
yr_built         1.971005e+03
yr_renovated     8.440226e+01
zipcode          9.807794e+04
lat              4.756005e+01
long            -1.222139e+02
sqft_living15    1.986552e+03
sqft_lot15       1.276846e+04
dtype: float64

In [17]:
# Daha detaylı bakalım
print(houses_mean.index)

Index(['id', 'price', 'bedrooms', 'bathrooms', 'sqft_living', 'sqft_lot',
       'floors', 'waterfront', 'view', 'condition', 'grade', 'sqft_above',
       'sqft_basement', 'yr_built', 'yr_renovated', 'zipcode', 'lat', 'long',
       'sqft_living15', 'sqft_lot15'],
      dtype='object')

In [18]:
# Kontrol edelim
type(houses_mean)

pandas.core.series.Series

In [19]:
# sum() metodu, belirtilen dataframe ya da series tipindeki değişken içerisindeki verileri toplar.
houses.sum()

id                                                  98994056770455
date             20141013T00000020141209T00000020150225T0000002...
price                                                11672925008.0
bedrooms                                                     72854
bathrooms                                                 45706.25
sqft_living                                               44952873
sqft_lot                                                 326506890
floors                                                     32296.5
waterfront                                                     163
view                                                          5064
condition                                                    73688
grade                                                       165488
sqft_above                                                38652488
sqft_basement                                              6300385
yr_built                                                  42599334
yr_renovated                                               1824186
zipcode                                                 2119758513
lat                                                   1027915.4151
long                                                  -2641408.943
sqft_living15                                             42935359
sqft_lot15                                               275964632
dtype: object

In [20]:
# Bir seri için sum() metodunu kullanalım
houses["price"].sum()

11672925008.0

In [21]:
# Veri tiplerini inceleyelim.
print(f"Type of \"houses\": {type(houses)}")
print(f"Type of \"houses.sum()\": {type(houses.sum())}")

print(f"Type of \"houses.price\": {type(houses.price)}")
print(f"Type of \"houses.price.sum()\": {type(houses.price.sum())}")

Type of "houses": <class 'pandas.core.frame.DataFrame'>
Type of "houses.sum()": <class 'pandas.core.series.Series'>
Type of "houses.price": <class 'pandas.core.series.Series'>
Type of "houses.price.sum()": <class 'numpy.float64'>

In [22]:
# Aynı işlemleri max() metodu için de gerçekleştirmek mümkündür.
print(houses.max(numeric_only=True))

id               9.900000e+09
price            7.700000e+06
bedrooms         3.300000e+01
bathrooms        8.000000e+00
sqft_living      1.354000e+04
sqft_lot         1.651359e+06
floors           3.500000e+00
waterfront       1.000000e+00
view             4.000000e+00
condition        5.000000e+00
grade            1.300000e+01
sqft_above       9.410000e+03
sqft_basement    4.820000e+03
yr_built         2.015000e+03
yr_renovated     2.015000e+03
zipcode          9.819900e+04
lat              4.777760e+01
long            -1.213150e+02
sqft_living15    6.210000e+03
sqft_lot15       8.712000e+05
dtype: float64

In [23]:
print(houses["price"].max())

7700000.0

In [24]:
print(type(houses.max()))

<class 'pandas.core.series.Series'>

In [25]:
print(type(houses["price"].max()))

<class 'float'>

In [26]:
# Peki seri veri tipindeki bir değişkenin shape niteliğine baktığımızda ne görürüz?
names.shape

(1309,)

***
## $Important$ $Series$ $Methods$

* `head()`
* `tail()`
* `describe()`
* `unique()`
* `nunique()`
* `nlargest()`
* `nsmallest()`
* `values_counts()`
* `plot()`

In [27]:
# head() metodu üzerinde daha önce durmuştuk, hatırlayalım.
titanic["age"].head(10)

0        29
1    0.9167
2         2
3        30
4        25
5        48
6        63
7        39
8        53
9        71
Name: age, dtype: object

In [28]:
# tail() metodu üzerinde daha önce durmuştuk, hatırlayalım.
netflix["title"].tail(50)

8757                 World Trade Center
8758             World's Busiest Cities
8759             World's Weirdest Homes
8760                   Would You Rather
8761                          Wrong No.
8762                    Wrong Side Raju
8763    WWII: Report from the Aleutians
8764                         Wyatt Earp
8765                                 XX
8766                                XXx
8767            XXX: State of the Union
8768                  Y Tu Mamá También
8769             Y.M.I.: Yeh Mera India
8770                            Yaadein
8771                   Yaara O Dildaara
8772              Yamla Pagla Deewana 2
8773                Yanda Kartavya Aahe
8774                          يوم الدين
8775                    Yeh Meri Family
8776                         Yellowbird
8777                          Yes or No
8778                        Yes or No 2
8779                      Yes or No 2.5
8780                       Yo-Kai Watch
8781            Yo-Kai Watch: The Movie
8782                        Yoga Hosers
8783                               Yoko
8784               Yoko and His Friends
8785                                YOM
8786                       You Can Tutu
8787          You Can’t Fight Christmas
8788                       You Carry Me
8789                You Changed My Life
8790      You Don't Mess with the Zohan
8791                        Young Adult
8792                        Young Tiger
8793               Yours, Mine and Ours
8794                             اشتباك
8795                    Yu-Gi-Oh! Arc-V
8796                         Yunus Emre
8797                          Zak Storm
8798                           Zed Plus
8799                              Zenda
8800                 Zindagi Gulzar Hai
8801                            Zinzana
8802                             Zodiac
8803                        Zombie Dumb
8804                         Zombieland
8805                               Zoom
8806                             Zubaan
Name: title, dtype: object

In [29]:
# describe() metodu değişken ile alakalı bazı istatistiksel bilgilere ulaşmamızı sağlar
houses.describe()

,id,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
count,2.161300e+04,2.161300e+04,21613.000000,21613.000000,21613.000000,2.161300e+04,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000,21613.000000
mean,4.580302e+09,5.400881e+05,3.370842,2.114757,2079.899736,1.510697e+04,1.494309,0.007542,0.234303,3.409430,7.656873,1788.390691,291.509045,1971.005136,84.402258,98077.939805,47.560053,-122.213896,1986.552492,12768.455652
std,2.876566e+09,3.671272e+05,0.930062,0.770163,918.440897,4.142051e+04,0.539989,0.086517,0.766318,0.650743,1.175459,828.090978,442.575043,29.373411,401.679240,53.505026,0.138564,0.140828,685.391304,27304.179631
min,1.000102e+06,7.500000e+04,0.000000,0.000000,290.000000,5.200000e+02,1.000000,0.000000,0.000000,1.000000,1.000000,290.000000,0.000000,1900.000000,0.000000,98001.000000,47.155900,-122.519000,399.000000,651.000000
25%,2.123049e+09,3.219500e+05,3.000000,1.750000,1427.000000,5.040000e+03,1.000000,0.000000,0.000000,3.000000,7.000000,1190.000000,0.000000,1951.000000,0.000000,98033.000000,47.471000,-122.328000,1490.000000,5100.000000
50%,3.904930e+09,4.500000e+05,3.000000,2.250000,1910.000000,7.618000e+03,1.500000,0.000000,0.000000,3.000000,7.000000,1560.000000,0.000000,1975.000000,0.000000,98065.000000,47.571800,-122.230000,1840.000000,7620.000000
75%,7.308900e+09,6.450000e+05,4.000000,2.500000,2550.000000,1.068800e+04,2.000000,0.000000,0.000000,4.000000,8.000000,2210.000000,560.000000,1997.000000,0.000000,98118.000000,47.678000,-122.125000,2360.000000,10083.000000
max,9.900000e+09,7.700000e+06,33.000000,8.000000,13540.000000,1.651359e+06,3.500000,1.000000,4.000000,5.000000,13.000000,9410.000000,4820.000000,2015.000000,2015.000000,98199.000000,47.777600,-121.315000,6210.000000,871200.000000

In [30]:
# Seri yapısı üzerinde uygulayalım
houses["price"].describe()

count    2.161300e+04
mean     5.400881e+05
std      3.671272e+05
min      7.500000e+04
25%      3.219500e+05
50%      4.500000e+05
75%      6.450000e+05
max      7.700000e+06
Name: price, dtype: float64

In [31]:
# Seri yapısı üzerinde uygulayalım
netflix["rating"].describe()

count      8803
unique       17
top       TV-MA
freq       3207
Name: rating, dtype: object

In [32]:
# info() metodunu hatırlayalım
netflix.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8807 entries, 0 to 8806
Data columns (total 12 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   show_id       8807 non-null   object
 1   type          8807 non-null   object
 2   title         8807 non-null   object
 3   director      6173 non-null   object
 4   cast          7982 non-null   object
 5   country       7976 non-null   object
 6   date_added    8797 non-null   object
 7   release_year  8807 non-null   int64
 8   rating        8803 non-null   object
 9   duration      8804 non-null   object
 10  listed_in     8807 non-null   object
 11  description   8807 non-null   object
dtypes: int64(1), object(11)
memory usage: 894.5+ KB

In [33]:
# dtypes, geriye bir seri yapısı döner, ilkel bir info() metoduna benzetilebilir.
netflix.dtypes

show_id         object
type            object
title           object
director        object
cast            object
country         object
date_added      object
release_year     int64
rating          object
duration        object
listed_in       object
description     object
dtype: object

In [34]:
# release_year sütununun nümerik olduğunu gördük. describe() metodunu uygulayalım
netflix["release_year"].describe()

count    8807.000000
mean     2014.180198
std         8.819312
min      1925.000000
25%      2013.000000
50%      2017.000000
75%      2019.000000
max      2021.000000
Name: release_year, dtype: float64

In [35]:
titanic["name"].dtype

dtype('O')